In [8]:
# This is a comment.
x = "Python"
y = "Is Great"
z = x + y
print (z)

PythonIs Great

In [ ]:
x = "awesome"

def myfunc():
  print("Python is " + x)

myfunc()

In [9]:
x = "awesome"

def myfunc():
    print ("Python is " + x)
    
myfunc()

Python is awesome

In [10]:
x = "awesome"

def myfunc():
  x = "fantastic"
  print("Python is " + x)

myfunc()

print("Python is " + x)

Python is fantastic
Python is awesome

In [11]:
def myfunc():
  global x
  x = "fantastic"

myfunc()

print("Python is " + x)

Python is fantastic

In [12]:
x = "awesome"

def myfunc():
  global x
  x = "fantastic"

myfunc()

print("Python is " + x)

Python is fantastic

In [11]:
##IF ELIF ELSE
score = int(input("enter your number: "))

if score < 0:
    score = 0
    print ("negative number changed to zero")
    
elif score == 0:
      print ("your input number is zero")
        
elif score == 1:
      print ("your input number is one")

else:
      print ("your input number is ", score)

enter your number: 6798457639487365834876374586255674323896557342653876534786538474232091921074356353748943019274653753476345673482653746573456743637
your input number is  6798457639487365834876374586255674323896557342653876534786538474232091921074356353748943019274653753476345673482653746573456743637

In [1]:
import numpy as np

In [2]:
help(np.array)

Help on built-in function array in module numpy:

array(...)
    array(object, dtype=None, copy=True, order='K', subok=False, ndmin=0)

    Create an array.

    Parameters
    ----------
    object : array_like
        An array, any object exposing the array interface, an object whose
        __array__ method returns an array, or any (nested) sequence.
    dtype : data-type, optional
        The desired data-type for the array.  If not given, then the type will
        be determined as the minimum type required to hold the objects in the
        sequence.
    copy : bool, optional
        If true (default), then the object is copied.  Otherwise, a copy will
        only be made if __array__ returns a copy, if obj is a nested sequence,
        or if a copy is needed to satisfy any of the other requirements
        (`dtype`, `order`, etc.).
    order : {'K', 'A', 'C', 'F'}, optional
        Specify the memory layout of the array. If object is not an array, the
        newly created array will be in C order (row major) unless 'F' is
        specified, in which case it will be in Fortran order (column major).
        If object is an array the following holds.

        ===== ========= ===================================================
        order  no copy                     copy=True
        ===== ========= ===================================================
        'K'   unchanged F & C order preserved, otherwise most similar order
        'A'   unchanged F order if input is F and not C, otherwise C order
        'C'   C order   C order
        'F'   F order   F order
        ===== ========= ===================================================

        When ``copy=False`` and a copy is made for other reasons, the result is
        the same as if ``copy=True``, with some exceptions for `A`, see the
        Notes section. The default order is 'K'.
    subok : bool, optional
        If True, then sub-classes will be passed-through, otherwise
        the returned array will be forced to be a base-class array (default).
    ndmin : int, optional
        Specifies the minimum number of dimensions that the resulting
        array should have.  Ones will be pre-pended to the shape as
        needed to meet this requirement.

    Returns
    -------
    out : ndarray
        An array object satisfying the specified requirements.

    See Also
    --------
    empty_like : Return an empty array with shape and type of input.
    ones_like : Return an array of ones with shape and type of input.
    zeros_like : Return an array of zeros with shape and type of input.
    full_like : Return a new array with shape of input filled with value.
    empty : Return a new uninitialized array.
    ones : Return a new array setting values to one.
    zeros : Return a new array setting values to zero.
    full : Return a new array of given shape filled with value.


    Notes
    -----
    When order is 'A' and `object` is an array in neither 'C' nor 'F' order,
    and a copy is forced by a change in dtype, then the order of the result is
    not necessarily 'C' as expected. This is likely a bug.

    Examples
    --------
    >>> np.array([1, 2, 3])
    array([1, 2, 3])

    Upcasting:

    >>> np.array([1, 2, 3.0])
    array([ 1.,  2.,  3.])

    More than one dimension:

    >>> np.array([[1, 2], [3, 4]])
    array([[1, 2],
           [3, 4]])

    Minimum dimensions 2:

    >>> np.array([1, 2, 3], ndmin=2)
    array([[1, 2, 3]])

    Type provided:

    >>> np.array([1, 2, 3], dtype=complex)
    array([ 1.+0.j,  2.+0.j,  3.+0.j])

    Data-type consisting of more than one element:

    >>> x = np.array([(1,2),(3,4)],dtype=[('a','<i4'),('b','<i4')])
    >>> x['a']
    array([1, 3])

    Creating an array from sub-classes:

    >>> np.array(np.mat('1 2; 3 4'))
    array([[1, 2],
           [3, 4]])

    >>> np.array(np.mat('1 2; 3 4'), subok=True)
    matrix([[1, 2],
            [3, 4]])

In [6]:
incrmnt = np.arange (1, 15,2)
incrmnt

array([ 1,  3,  5,  7,  9, 11, 13])

In [8]:
incrmnt = np.arange (10, 50, -10)
incrmnt

array([], dtype=int32)

In [10]:
np.zeros(5)

array([0., 0., 0., 0., 0.])

In [11]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [13]:
np.random.randint(1,10,(3,3))

array([[2, 1, 2],
       [9, 4, 4],
       [8, 2, 7]])

In [2]:
import numpy as np
array2d = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print(array2d)

[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]

In [3]:
print(array2d[::2])

[[ 1  2  3  4]
 [ 9 10 11 12]]

In [1]:
import pandas as pd

In [2]:
num_series = pd.Series([3,6,9,12,15,18,21])
print(num_series)

0     3
1     6
2     9
3    12
4    15
5    18
6    21
dtype: int64

In [3]:
date_series = pd.date_range(start = '01-04-2020', end = '19-04-2020')
print(date_series)

DatetimeIndex(['2020-01-04', '2020-01-05', '2020-01-06', '2020-01-07',
               '2020-01-08', '2020-01-09', '2020-01-10', '2020-01-11',
               '2020-01-12', '2020-01-13',
               ...
               '2020-04-10', '2020-04-11', '2020-04-12', '2020-04-13',
               '2020-04-14', '2020-04-15', '2020-04-16', '2020-04-17',
               '2020-04-18', '2020-04-19'],
              dtype='datetime64[ns]', length=107, freq='D')

In [4]:
basket_df = pd.DataFrame({'fruit': ['Banana', 'Guava', 'Orange', 'apple', 'kiwi'],
                         'weight': [12, 1, 24, 2, 8],
                         'color':['Yellow', 'Green', 'Pale Yellow', 'Red', 'Brown']})
basket_df

    fruit  weight        color
0  Banana      12       Yellow
1   Guava       1        Green
2  Orange      24  Pale Yellow
3   apple       2          Red
4    kiwi       8        Brown

In [4]:
data = {'state':['Texas','Texas','Texas','Ohio','Ohio'], 'year':[2001,2002,2003,2001,2002], 'pop':[1.3,1.4,1.5,2.4,2.6]}
data

{'state': ['Texas', 'Texas', 'Texas', 'Ohio', 'Ohio'],
 'year': [2001, 2002, 2003, 2001, 2002],
 'pop': [1.3, 1.4, 1.5, 2.4, 2.6]}

In [15]:
import pandas as pd
from pandas import Series, DataFrame
df1 = pd.DataFrame(data)

In [16]:
df1

   state  year  pop
0  Texas  2001  1.3
1  Texas  2002  1.4
2  Texas  2003  1.5
3   Ohio  2001  2.4
4   Ohio  2002  2.6

In [17]:
df2 = pd.DataFrame(data, columns=['year','state','pop'], index=['one','two','three','four','five'])

In [18]:
df2

       year  state  pop
one    2001  Texas  1.3
two    2002  Texas  1.4
three  2003  Texas  1.5
four   2001   Ohio  2.4
five   2002   Ohio  2.6

In [19]:
df2['state']

one      Texas
two      Texas
three    Texas
four      Ohio
five      Ohio
Name: state, dtype: object

In [20]:
df2.loc[['one', 'three'], ['year', 'pop']]

       year  pop
one    2001  1.3
three  2003  1.5

In [21]:
df2.iloc[:, [2]]

       pop
one    1.3
two    1.4
three  1.5
four   2.4
five   2.6

In [22]:
df2.iloc[[1],[1,2]]

     state  pop
two  Texas  1.4

In [23]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['one','two','three','four'], columns=['CA','TX','WA','NY'])
data

NameError: name 'np' is not defined

In [29]:
df2
df2.drop(['year', 'state'], axis = 1)
df2

       year  state  pop
one    2001  Texas  1.3
two    2002  Texas  1.4
three  2003  Texas  1.5
four   2001   Ohio  2.4
five   2002   Ohio  2.6

In [5]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [6]:
df = pd.DataFrame(np.arange(8).reshape((2,4)), index=['C','A'],columns=['d','a','c','b'])
df

   d  a  c  b
C  0  1  2  3
A  4  5  6  7

In [7]:
df.sort_index()

   d  a  c  b
A  4  5  6  7
C  0  1  2  3

In [9]:
df.sort_index (axis = 1, ascending = False)

   d  c  b  a
C  0  2  3  1
A  4  6  7  5

In [10]:
df2 = DataFrame({'b':[4,7,-2,3],'a':[0,1,0,1]})
df2

   b  a
0  4  0
1  7  1
2 -2  0
3  3  1

In [15]:
df2.sort_values (by = ["b", "a"], ascending = False)

   b  a
1  7  1
0  4  0
3  3  1
2 -2  0

In [16]:
obj = Series([7,-5,3,2,0,4,7,3])
obj

0    7
1   -5
2    3
3    2
4    0
5    4
6    7
7    3
dtype: int64

In [17]:
df3 = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
df3

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [18]:
frame = pd.DataFrame(np.random.randn(4,3),columns=['b','d','e'],index=['CA','OH','MA','OR'])
frame

           b         d         e
CA -0.914632  0.602958 -1.413438
OH  0.016461  1.445746 -1.936417
MA  2.424199 -0.405915  0.627411
OR -1.042428 -1.130795  1.852812

In [19]:
frame.applymap(np.abs)

           b         d         e
CA  0.914632  0.602958  1.413438
OH  0.016461  1.445746  1.936417
MA  2.424199  0.405915  0.627411
OR  1.042428  1.130795  1.852812

In [20]:
frame

           b         d         e
CA -0.914632  0.602958 -1.413438
OH  0.016461  1.445746 -1.936417
MA  2.424199 -0.405915  0.627411
OR -1.042428 -1.130795  1.852812

In [21]:
def percentage(a):
  x1 = np.round(a*100, 2)
  x2 = str(x1) + '%'
  return x2

In [22]:
frame['f']= frame['e'].apply(percentage)

In [23]:
frame

           b         d         e         f
CA -0.914632  0.602958 -1.413438  -141.34%
OH  0.016461  1.445746 -1.936417  -193.64%
MA  2.424199 -0.405915  0.627411    62.74%
OR -1.042428 -1.130795  1.852812   185.28%

In [3]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [4]:
tips = sns.load_dataset('tips')

In [5]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:

tips.groupby(by = 'sex')['total_bill'].mean()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [8]:
tips[['sex', 'smoker', 'day', 'tip']].groupby(by = ['sex', 'smoker', 'day']).mean()

                         tip
sex    smoker day
Male   Yes    Thur  3.058000
              Fri   2.741250
              Sat   2.879259
              Sun   3.521333
       No     Thur  2.941500
              Fri   2.500000
              Sat   3.256563
              Sun   3.115349
Female Yes    Thur  2.990000
              Fri   2.682857
              Sat   2.868667
              Sun   3.500000
       No     Thur  2.459600
              Fri   3.125000
              Sat   2.724615
              Sun   3.329286

In [30]:
tips[['sex','total_bill']].groupby(by = 'sex').mean()

        total_bill
sex
Male     20.744076
Female   18.056897

In [33]:
tips[['sex', 'total_bill']].groupby(by = 'sex').mean().reset_index()

      sex  total_bill
0    Male   20.744076
1  Female   18.056897

In [37]:
tips[['sex', 'smoker', 'total_bill']].groupby(by = ['sex','smoker']).mean()

               total_bill
sex    smoker
Male   Yes      22.284500
       No       19.791237
Female Yes      17.977879
       No       18.105185

In [39]:
tips[['sex', 'smoker', 'time', 'tip']].groupby(by = ['sex', 'smoker', 'time']).mean()

                           tip
sex    smoker time
Male   Yes    Lunch   2.790769
              Dinner  3.123191
       No     Lunch   2.941500
              Dinner  3.158052
Female Yes    Lunch   2.891000
              Dinner  2.949130
       No     Lunch   2.459600
              Dinner  3.044138

In [1]:
tips.head()

NameError: name 'tips' is not defined

In [2]:
tips = sns.load_dataset('tips')

NameError: name 'sns' is not defined